# 18

# P(X = 2)
dbinom(2, 10, 1/6)
choose(10,2) * (1/6)^2 * (5/6) ^ 8

# P (X <= 2)
pbinom(2,10,1/6)
dbinom(0,10,1/6) + dbinom(1,10,1/6) + dbinom(2,10,1/6)

# P(X >= 2)
1 -pbinom(2,10,1/6)

# P( 3 <= X <= 8 )
pbinom(8,10,1/6) - pbinom(2,10,1/6)
sum(dbinom(3:8, 10, 1/6))


# 19
#P(X<=10)
pgeom(10-1,1/6)
#P(X>=6)
1- pgeom(6-1,1/6)


# 20
# P(X <= 20)
pnbinom(20-3,3,1/6)



# 21
# Иван 8 батерии - 5 нови 3 стари 
# 5/8, 3/8

# P(X = 0) + P(X = 1)
dhyper(0, 5, 3, 2) + dhyper(1, 5, 3, 2)

# 1-P( X = 2 )
1 - dhyper(2,5,3,2)
1 - choose(5,2) * choose(3,0) / choose(8,2)



# 22
# 1/500 грешки на думи
# 300 думи 
# P(X<=2) грешки на страница
# страници 5 * 300 = 1500
pbinom(2, 1500, 1/500)
ppois(2, 1500/500)

# b) 1 < 3 
sum (dbinom((1:3), 1500, 1/500))

# P( 1 <= X <= 3) = P(X <=3) - P(X=0)
pbinom(3,1500,1/500) - dbinom(0,1500,1/500)

ppois(3, 1500/500) - ppois(0,1500/500)


# 23
# 10 въпроса - 4 възможни отгоовра

1-pbinom(5-1,10,1/4)


# 24

pbinom(138,143,0.92)

dbinom(137,143,0.92)


# 25
# 0.03

#a)
pgeom(10-1,0.03)

#b) P(X>2) = 1-P(X<=1)
1 -pbinom(1,50,0.03)


# 26
1 - phyper(1,3,97,50)

# 27
1- phyper(1,90,3000-90,50)


# 28

# P(X>=5)

1 - pgeom(3,1/10)

#b)  изватка от >=50 за 10 доброволци
pnbinom(39,10,1/10)


# 29
1-ppois(3,4)


# 30

1-phyper(2,13,52-13,10)


# 31

1- pbinom(1, 10, 13/52 )







